#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//逻辑运算符
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a ++ && ++ b && d++;
//	printf("%d %d %d %d\n", a, b, c, d); // 1 2 3 4
//	return 0;
//}

//如果&&左边为假,右边无需计,结果为假;
//如果||左边为真,右边无需计算,结果为真;

int main()
{
	int i = 1, a = 0, b = 2, c = 3, d = 4;
	i = a++ || ++b || d++;
	printf("%d %d %d %d\n", a, b, c, d); // 1 3 3 4
	return 0;
}

//条件表达式(三目操作符)
//int main()
//{
//	int a = 5, b = 10, max = 0;
//	if (a > b)
//		 max = a;
//	else
//		 max = b;
//
//	//等同于
//	int max = (a > b ? a : b);  //条件表达式 ? 表达式语句 : 表达式语句;
//	return 0;
//}

//逗号表达式，就是用逗号隔开的多个表达式。
//逗号表达式，从左向右依次执行。整个表达式的结果是最后一个表达式的结果。
//int main()
//{
//	int a = 1, b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);
//	printf("%d\n", c); // 13
//	return 0;
//}


//下表引用操作符 ===> 操作数：一个数组名 + 一个索引值
// 
//函数引用操作符 ===> 接受一个或者多个操作数：第一个操作数是函数名，剩余的操作数就是传递给函数的参数。

//结构体
//学生
//创建了一个结构体类型-->struct Stu
struct Stu
{
	//成员变量
	char name[20];
	int age;
	char id[20];
};
//int main()
//{
//	//使用struct Stu这个类型创建了一个学生对象s1,并初始化
//	struct Stu s1 = {"李鹏飞",23,"ZB1020110"};
//	//结构体变量.成员名
//	printf("nanme = %s,age = %d,id = %s\n",s1.name,s1.age,s1.id);
//	struct Stu* ps = &s1;
//	printf("%p\n", ps);
//	// (*ps) ==> s1
//	printf("nanme = %s,age = %d,id = %s\n", (*ps).name, (*ps).age, (*ps).id);
//	// ->结构体指针->成员名
//	printf("nanme = %s,age = %d,id = %s\n", ps->name, ps->age, ps->id);
//	return 0;
//}

//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//00000011 ->a
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111 -> b
//	
//
//	//a和b如何相加
//	//整型提升
//	//00000011 ->a
//	//00000000000000000000000000000011
//	//01111111 -> b
//	//00000000000000000000000001111111
//  //相加
//	//00000000000000000000000010000010
//	char c = a + b;
//	//截断
//	//10000010 ->c
//	//打印整型,整型提升
//	//11111111111111111111111110000010-->补码
//	//11111111111111111111111110000001-->反码
//	//10000000000000000000000001111110-->原码
//	//-126
//	printf("%d\n", c);
//	return 0;
//}

//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c)); //1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(!c));//1
//}
